tsung_tests/tsung_comments.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="1000" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="avani-test.eba-fz2dfqnp.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="10" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="10" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="10" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>

    <session name="comments" weight="1" type="ts_http">

        <!-- VIEW POST -->
        <request>
            <http url='/posts/' version='1.1' method='GET'></http>
        </request>

        <!-- wait for up to 2 seconds -->
        <!-- <thinktime value="2" random="true"></thinktime> -->

        <!-- create a random number to select a random post and create a random string to comment on the post -->
        <setdynvars sourcetype="random_number" start="1" end="100">
            <var name="random_num" />
        </setdynvars>

        <setdynvars sourcetype="random_string" length="20">
            <var name="random_string" />
        </setdynvars>

        <!-- GET POST -->
        <request subst="true">
            <dyn_variable name="authenticity_token" ></dyn_variable>
            <http
            url='/posts/%%_random_num%%/'
            version='1.1'
            method='GET'>
            </http>
        </request>

        <!--POST COMMENT-->
        <request subst="true">
            <http url="/posts/%%_random_num%%/comments" version='1.1' method="POST"
            content_type="application/x-www-form-urlencoded"
            contents='authenticity_token=%%_authenticity_token%%&amp;comment%5Bbody%5D=%%_random_string%%&amp;commit=Create+Comment'>
            </http>
        </request>
        
    </session>
    
  </sessions>
</tsung>